Revit 2024 API
AnalysisDisplayLegendSettings.ShowDataName Property
 If true, data name is shown in the legend.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool ShowDataName { get; set; }
Visual Basic
Public Property ShowDataName As Boolean
	Get
	Set
Visual C++
public:
property bool ShowDataName {
	bool get ();
	void set (bool value);
}
See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace